W4D4/music_app/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Clocks"], ["year", 1999], ["band_id", 2], ["created_at", "2018-09-13 22:22:26.556683"], ["updated_at", "2018-09-13 22:22:26.556683"]]
---
  def create
    @album = Album.new(album_params)

    if @album.save