W4D3/app/models/user.rb

INSERT INTO "users" ("password_digest", "session_token", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "aqH2efUQiMqE8f-HMMQhsQ"], ["updated_at", "2018-09-13 00:02:07.658401"], ["id", 3]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "catwood"], ["LIMIT", 1]]
---
  def User.find_by_credentials(username, pw)
    user = User.find_by(username: username)