W4D3/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    @user.reset_session_token!

    if @user.save
---
INSERT INTO "users" ("password_digest", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def show
    # debugger
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]