W5D2/reddit/app/controllers/comments_controller.rb

  def new
    @comment = Comment.new
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @comment.post_id = params[:comment][:post_id]

    @comment.save
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "WOW WHAT AMAZING POST"], ["user_id", 1], ["post_id", 2], ["created_at", "2018-09-19 00:31:32.697257"], ["updated_at", "2018-09-19 00:31:32.697257"]]