W5D2/reddit/app/controllers/posts_controller.rb

SELECT "subs".* FROM "subs" WHERE 1=0
---
  def new
    @post = Post.new
    @subs = Sub.all

INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def edit
    @post = current_user.posts.find(params[:id])