W4D5/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "zapdos"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, pw)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Mx1i5VE64H77f4NVjcPadg"], ["updated_at", "2018-09-14 23:21:11.425073"], ["id", 2]]
---
  def reset_session_token!
    generate_session_token
    self.save!