W5D2/reddit/app/views/posts/new.html.erb


  <% Sub.all.each do |sub| %>
    <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>"> <%= sub.title %>
    <%= "checked" if @post.sub_ids.include?(sub.id) %>
---
SELECT "subs".* FROM "subs"
SELECT  1 AS one FROM "post_subs" WHERE "post_subs"."post_id" IS NULL AND "post_subs"."sub_id" = $1 LIMIT $2  [["sub_id", 1], ["LIMIT", 1]]