W4D5/app/views/users/index.html.erb

<ul>
  <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"