W4D4/music_app/app/models/user.rb

  def generate_session_token
    token = SecureRandom.urlsafe_base64

    while User.exists?(session_token: token)
---
SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "PjvdxCFmCXLvWnOpGgKDAg"], ["LIMIT", 1]]

  def User.find_by_credentials(email, pw)
    @user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ajgosling"], ["LIMIT", 1]]