W4D4/music_app/app/views/albums/new.html.erb

    <option value="" selected disabled>--CHOOSE BAND--</option>
    <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"