W4D2/cats/app/controllers/cat_rental_requests_controller.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"
---
  def index
    render json: CatRentalRequest.all