W4D1/routes_practice/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
  def index
    artworkshares = ArtworkShare.all