W4D1/routes_practice/app/controllers/users_controller.rb

  def index
    users = Artwork.all
---
SELECT "artworks".* FROM "artworks"

  def create
    user = User.new(user_params)
    #
    # render json: params
    if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "HarambeJR"], ["email", "ireallyidk@gmail.com"]]

  def update
    user = User.find(params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "Will"], ["id", 3]]